Repository: jude-m/the-wisdom-project
Catalog: lib/core/localization/l10n/app_*.arb
Languages: si

# appTitle
source: The Wisdom Project
si: ප්‍රඥා ව්‍යාපෘතිය

# treeNavigatorTitle
source: Tipitaka Navigator
si: ත්‍රිපිටක සංචාලකය

# readerTitle
source: Reader
si: පාඨකය

# columnModePaliOnly
source: Pali Only
si: පාලි පමණයි

# columnModeSinhalaOnly
source: Sinhala Only
si: සිංහල පමණයි

# columnModeBoth
source: Both
si: දෙකම

# paliLanguageLabel
source: Pali
si: පාලි

# sinhalaLanguageLabel
source: Sinhala
si: සිංහල

source: Loading...
si: පූරණය වෙමින්...

source: Error loading content
si: අන්තර්ගතය පූරණය කිරීමේ දෝෂයකි

# errorLoadingTree
source: Error loading navigation tree
si: සංචාලන ව්‍යූහය පූරණය කිරීමේ දෝෂයකි

source: Retry
si: යළි උත්සාහ කරන්න

# selectNodeToRead
source: Select a sutta from the navigator to begin reading
si: කියවීම ආරම්භ කිරීමට සංචාලකයෙන් සූත්‍රයක් තෝරන්න

# searchPlaceholder
source: Search Tipitaka...
si: ත්‍රිපිටකයේ සොයන්න...

source: No results found
si: ප්‍රතිඵල හමු නොවීය

source: Expand All
si: සියල්ල විශාල කරන්න

source: Collapse All
si: සියල්ල හකුළන්න

source: Settings
si: සැකසීම්

source: Navigation Language
si: සංචාලන භාෂාව

source: Font Size
si: අක්ෂර ප්‍රමාණය

# fontSizeSmall
source: Small
si: කුඩා

# fontSizeMedium
source: Medium
si: මධ්‍යම

# fontSizeLarge
source: Large
si: විශාල

# fontSizeExtraLarge
source: Extra Large
si: අතිශය විශාල

source: Close
si: වසන්න

# searchHint
source: Search
si: සෙවුම් පදය ඇතුලත් කරන්න

# isExactMatchToggle
source: Exact word match
si: එම වචනයම සොයන්න

source: Refine Search
si: සූක්ෂම සෙවීම

source: Refine
si: සූක්ෂම

source: Scope
si: පරාසය

source: Word Proximity
si: වචන ආසන්නතාව

# phraseSearch
source: Phrase search (exact consecutive words)
si: වාක්‍ය ඛණ්ඩ සෙවීම (පිළිවෙලට ඇති වචන)

# wordsApart
source: {count} words apart
si: වචන {count}ක් පරතරයකින්

source: Exact consecutive words
si: හරියටම පිළිවෙලට ඇති වචන

source: Apply
si: යොදන්න

source: Reset
si: යළි සකසන්න

source: Clear
si: ඉවත් කරන්න

# scopeAll
source: All
si: සියල්ල

# scopeSutta
source: Sutta
si: සුත්ත

# scopeVinaya
source: Vinaya
si: විනය

# scopeAbhidhamma
source: Abhidhamma
si: අභිධම්ම

# scopeCommentaries
source: Commentaries
si: අට්ඨකථා

# scopeTreatises
source: Treatises
si: ග්‍රන්ථ

# searchAsPhrase
source: Search as complete phrase
si: සම්පුර්ණ වාක්‍යක් ලෙස

source: Search as separate words
si: වෙන්වූ වචන සමූහයක් ලෙස

# anywhereInText
source: Anywhere in the same text
si: එකම පෙළෙහි ඕනෑම තැනක

source: No definitions found
si: අර්ථ දැක්වීම් හමු නොවීය

# dictionaryLookup
source: Dictionary
si: ශබ්දකෝෂය

source: Error loading definitions
si: අර්ථ දැක්වීම් පූරණය කිරීමේ දෝෂයකි
